#+title: Examples

Reverse a string

#+begin_src java :exports both
class StringStuff {
    public static String reverse(String s) {
        if (s.length() == 0) {
            return "";
        } else {
            return reverse(s.substring(1)) + s.charAt(0);
        }
    }

    public static void main(String[] args) {
        System.out.println(reverse("coconut"));
    }
}
#+end_src

#+RESULTS:
: tunococ


#+begin_src java :exports both
class TowersOfHanoiDemo {
    public static void move(int count, int start, int finish, int staging) {
        if (count == 1) {
            System.out.println("Move disk " + count +
                               " from " + start + " to " + finish);
        } else {
            move(count-1, start, staging, finish);
            System.out.println("Move disk " + count +
                               " from " + start + " to " + finish);
            move(count-1, staging, finish, start);
        }
    }

    public static void main(String[] args) {
        move(4, 1, 3, 2);
    }
}
#+end_src

#+RESULTS:
#+begin_example
Move disk 1 from 1 to 2
Move disk 2 from 1 to 3
Move disk 1 from 2 to 3
Move disk 3 from 1 to 2
Move disk 1 from 3 to 1
Move disk 2 from 3 to 2
Move disk 1 from 1 to 2
Move disk 4 from 1 to 3
Move disk 1 from 2 to 3
Move disk 2 from 2 to 1
Move disk 1 from 3 to 1
Move disk 3 from 2 to 3
Move disk 1 from 1 to 2
Move disk 2 from 1 to 3
Move disk 1 from 2 to 3
#+end_example
